# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 2s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 2s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_stag: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 2s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 2s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.k6_operator will be updated in-place
  ~ resource "helm_release" "k6_operator" {
      ~ id                         = "k6-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.0.0" -> (known after apply)
          ~ chart          = "k6-operator" -> (known after apply)
          ~ first_deployed = 1733489406 -> (known after apply)
          ~ last_deployed  = 1758810647 -> (known after apply)
          ~ name           = "k6-operator" -> (known after apply)
          ~ namespace      = "k6-operator-system" -> (known after apply)
          ~ notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> (known after apply)
          ~ revision       = 10 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - installCRDs = true
                  - namespace   = {
                      - create = false
                    }
                }
            ) -> (known after apply)
          ~ version        = "4.0.0" -> (known after apply)
        } -> (known after apply)
        name                       = "k6-operator"
      ~ version                    = "4.0.0" -> "3.16.0"
        # (27 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.83.0" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1733406099 -> (known after apply)
          ~ last_deployed  = 1757409722 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
            EOT -> (known after apply)
          ~ revision       = 27 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alertmanager = {
                      - enabled = true
                    }
                  - crds         = {
                      - enabled = false
                    }
                  - grafana      = {
                      - enabled = false
                    }
                  - prometheus   = {
                      - enabled        = true
                      - prometheusSpec = {
                          - enableRemoteWriteReceiver = true
                          - externalLabels            = {
                              - cluster = "k6tests-cluster"
                            }
                          - nodeSelector              = {
                              - prometheus = "true"
                            }
                          - podMetadata               = {
                              - labels = {
                                  - "azure.workload.identity/use" = "true"
                                }
                            }
                          - priorityClassName         = "system-cluster-critical"
                          - remoteWrite               = [
                              - {
                                  - azureAd = {
                                      - cloud = "AzurePublic"
                                      - sdk   = {
                                          - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                        }
                                    }
                                  - url     = "https://k6tests-amw-0vej.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-81e9cf1b38fb4648b047399c5593ebda/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                },
                            ]
                          - resources                 = {
                              - requests = {
                                  - memory = "8Gi"
                                }
                            }
                          - retention                 = "8d"
                          - storageSpec               = {
                              - volumeClaimTemplate = {
                                  - spec = {
                                      - resources = {
                                          - requests = {
                                              - storage = "64Gi"
                                            }
                                        }
                                    }
                                }
                            }
                          - tolerations               = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "workload"
                                  - operator = "Equal"
                                  - value    = "prometheus"
                                },
                            ]
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "azure.workload.identity/client-id" = "c4eeeead-8978-41a4-a989-e6e4aa9df603"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "75.18.1" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ version                    = "75.18.1" -> "77.10.0"
        # (27 unchanged attributes hidden)
    }

  # helm_release.prometheus_operator_crds will be updated in-place
  ~ resource "helm_release" "prometheus_operator_crds" {
      ~ id                         = "prometheus-operator-crds" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.85.0" -> (known after apply)
          ~ chart          = "prometheus-operator-crds" -> (known after apply)
          ~ first_deployed = 1733406085 -> (known after apply)
          ~ last_deployed  = 1758811334 -> (known after apply)
          ~ name           = "prometheus-operator-crds" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 12 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "23.0.0" -> (known after apply)
        } -> (known after apply)
        name                       = "prometheus-operator-crds"
      ~ version                    = "23.0.0" -> "22.0.2"
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan` |